sergev/pic32prog/target.c
    /*--------------------------------------
     * Configuration register 2
     */
    printf ("    DEVCFG2 = %08x\n", devcfg2);
    switch (devcfg2 & DEVCFG2_FPLLIDIV_MASK) {
    case DEVCFG2_FPLLIDIV_1:
        printf ("                     %u PLL divider: 1/1\n", DEVCFG2_FPLLIDIV_1);
        break;
    case DEVCFG2_FPLLIDIV_2:
        printf ("                     %u PLL divider: 1/2\n", DEVCFG2_FPLLIDIV_2);
        break;
    case DEVCFG2_FPLLIDIV_3:
        printf ("                     %u PLL divider: 1/3\n", DEVCFG2_FPLLIDIV_3);
        break;
    case DEVCFG2_FPLLIDIV_4:
        printf ("                     %u PLL divider: 1/4\n", DEVCFG2_FPLLIDIV_4);
        break;
    case DEVCFG2_FPLLIDIV_5:
        printf ("                     %u PLL divider: 1/5\n", DEVCFG2_FPLLIDIV_5);
        break;
    case DEVCFG2_FPLLIDIV_6:
        printf ("                     %u PLL divider: 1/6\n", DEVCFG2_FPLLIDIV_6);
        break;
    case DEVCFG2_FPLLIDIV_10:
        printf ("                     %u PLL divider: 1/10\n", DEVCFG2_FPLLIDIV_10);
        break;
    case DEVCFG2_FPLLIDIV_12:
        printf ("                     %u PLL divider: 1/12\n", DEVCFG2_FPLLIDIV_12);
        break;
    }
    switch (devcfg2 & DEVCFG2_FPLLMUL_MASK) {
    case DEVCFG2_FPLLMUL_15:
        printf ("                    %u  PLL multiplier: 15x\n", DEVCFG2_FPLLMUL_15 >> 4);
        break;
    case DEVCFG2_FPLLMUL_16:
        printf ("                    %u  PLL multiplier: 16x\n", DEVCFG2_FPLLMUL_16 >> 4);
        break;
    case DEVCFG2_FPLLMUL_17:
        printf ("                    %u  PLL multiplier: 17x\n", DEVCFG2_FPLLMUL_17 >> 4);
        break;
    case DEVCFG2_FPLLMUL_18:
        printf ("                    %u  PLL multiplier: 18x\n", DEVCFG2_FPLLMUL_18 >> 4);
        break;
    case DEVCFG2_FPLLMUL_19:
        printf ("                    %u  PLL multiplier: 19x\n", DEVCFG2_FPLLMUL_19 >> 4);
        break;
    case DEVCFG2_FPLLMUL_20:
        printf ("                    %u  PLL multiplier: 20x\n", DEVCFG2_FPLLMUL_20 >> 4);
        break;
    case DEVCFG2_FPLLMUL_21:
        printf ("                    %u  PLL multiplier: 21x\n", DEVCFG2_FPLLMUL_21 >> 4);
        break;
    case DEVCFG2_FPLLMUL_24:
        printf ("                    %u  PLL multiplier: 24x\n", DEVCFG2_FPLLMUL_24 >> 4);
        break;
    }
    switch (devcfg2 & DEVCFG2_UPLLIDIV_MASK) {
    case DEVCFG2_UPLLIDIV_1:
        printf ("                   %u   USB PLL divider: 1/1\n", DEVCFG2_UPLLIDIV_1 >> 8);
        break;
    case DEVCFG2_UPLLIDIV_2:
        printf ("                   %u   USB PLL divider: 1/2\n", DEVCFG2_UPLLIDIV_2 >> 8);
        break;
    case DEVCFG2_UPLLIDIV_3:
        printf ("                   %u   USB PLL divider: 1/3\n", DEVCFG2_UPLLIDIV_3 >> 8);
        break;
    case DEVCFG2_UPLLIDIV_4:
        printf ("                   %u   USB PLL divider: 1/4\n", DEVCFG2_UPLLIDIV_4 >> 8);
        break;
    case DEVCFG2_UPLLIDIV_5:
        printf ("                   %u   USB PLL divider: 1/5\n", DEVCFG2_UPLLIDIV_5 >> 8);
        break;
    case DEVCFG2_UPLLIDIV_6:
        printf ("                   %u   USB PLL divider: 1/6\n", DEVCFG2_UPLLIDIV_6 >> 8);
        break;
    case DEVCFG2_UPLLIDIV_10:
        printf ("                   %u   USB PLL divider: 1/10\n", DEVCFG2_UPLLIDIV_10 >> 8);
        break;
    case DEVCFG2_UPLLIDIV_12:
        printf ("                   %u   USB PLL divider: 1/12\n", DEVCFG2_UPLLIDIV_12 >> 8);
        break;
    }
    if (devcfg2 & DEVCFG2_UPLLDIS)
        printf ("                  %u    Disable USB PLL\n",
            DEVCFG2_UPLLDIS >> 12);
    else
        printf ("                       Enable USB PLL\n");

    switch (devcfg2 & DEVCFG2_FPLLODIV_MASK) {
    case DEVCFG2_FPLLODIV_1:
        printf ("                 %u     PLL postscaler: 1/1\n", DEVCFG2_FPLLODIV_1 >> 16);
        break;
    case DEVCFG2_FPLLODIV_2:
        printf ("                 %u     PLL postscaler: 1/2\n", DEVCFG2_FPLLODIV_2 >> 16);
        break;
    case DEVCFG2_FPLLODIV_4:
        printf ("                 %u     PLL postscaler: 1/4\n", DEVCFG2_FPLLODIV_4 >> 16);
        break;
    case DEVCFG2_FPLLODIV_8:
        printf ("                 %u     PLL postscaler: 1/8\n", DEVCFG2_FPLLODIV_8 >> 16);
        break;
    case DEVCFG2_FPLLODIV_16:
        printf ("                 %u     PLL postscaler: 1/16\n", DEVCFG2_FPLLODIV_16 >> 16);
        break;
    case DEVCFG2_FPLLODIV_32:
        printf ("                 %u     PLL postscaler: 1/32\n", DEVCFG2_FPLLODIV_32 >> 16);
        break;
    case DEVCFG2_FPLLODIV_64:
        printf ("                 %u     PLL postscaler: 1/64\n", DEVCFG2_FPLLODIV_64 >> 16);
        break;
    case DEVCFG2_FPLLODIV_256:
        printf ("                 %u     PLL postscaler: 1/128\n", DEVCFG2_FPLLODIV_256 >> 16);
        break;
    }

    /*--------------------------------------
     * Configuration register 3
     */
    printf ("    DEVCFG3 = %08x\n", devcfg3);
    if (~devcfg3 & DEVCFG3_USERID_MASK)
        printf ("                  %04x User-defined ID\n",
            devcfg3 & DEVCFG3_USERID_MASK);

    switch (devcfg3 & DEVCFG3_FSRSSEL_MASK) {
    case DEVCFG3_FSRSSEL_ALL:
        printf ("                 %u     All irqs assigned to shadow set\n", DEVCFG3_FSRSSEL_ALL >> 16);
        break;
    case DEVCFG3_FSRSSEL_1:
        printf ("                 %u     Assign irq priority 1 to shadow set\n", DEVCFG3_FSRSSEL_1 >> 16);
        break;
    case DEVCFG3_FSRSSEL_2:
        printf ("                 %u     Assign irq priority 2 to shadow set\n", DEVCFG3_FSRSSEL_2 >> 16);
        break;
    case DEVCFG3_FSRSSEL_3:
        printf ("                 %u     Assign irq priority 3 to shadow set\n", DEVCFG3_FSRSSEL_3 >> 16);
        break;
    case DEVCFG3_FSRSSEL_4:
        printf ("                 %u     Assign irq priority 4 to shadow set\n", DEVCFG3_FSRSSEL_4 >> 16);
        break;
    case DEVCFG3_FSRSSEL_5:
        printf ("                 %u     Assign irq priority 5 to shadow set\n", DEVCFG3_FSRSSEL_5 >> 16);
        break;
    case DEVCFG3_FSRSSEL_6:
        printf ("                 %u     Assign irq priority 6 to shadow set\n", DEVCFG3_FSRSSEL_6 >> 16);
        break;
    case DEVCFG3_FSRSSEL_7:
        printf ("                 %u     Assign irq priority 7 to shadow set\n", DEVCFG3_FSRSSEL_7 >> 16);
        break;
    }
    if (devcfg3 & DEVCFG3_FMIIEN)
        printf ("               %u       Ethernet MII enabled\n",
            DEVCFG3_FMIIEN >> 24);
    else
        printf ("                       Ethernet RMII enabled\n");

    if (devcfg3 & DEVCFG3_FETHIO)
        printf ("               %u       Default Ethernet i/o pins\n",
            DEVCFG3_FETHIO >> 24);
    else
        printf ("                       Alternate Ethernet i/o pins\n");

    if (devcfg3 & DEVCFG3_FCANIO)
        printf ("               %u       Default CAN i/o pins\n",
            DEVCFG3_FCANIO >> 24);
    else
        printf ("                       Alternate CAN i/o pins\n");

    if (devcfg3 & DEVCFG3_FUSBIDIO)
        printf ("              %u        USBID pin: controlled by USB\n",
            DEVCFG3_FUSBIDIO >> 28);
    else
        printf ("                       USBID pin: controlled by port\n");

    if (devcfg3 & DEVCFG3_FVBUSONIO)
        printf ("              %u        VBuson pin: controlled by USB\n",
            DEVCFG3_FVBUSONIO >> 28);
    else
        printf ("                       VBuson pin: controlled by port\n");
}

